eisup_2019_docmng_integration/src/Documents/ПереносДанных/ПереносДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносДанных</name>
  <comment>(Общ)</comment>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</registerRecords>
  <registerRecords>InformationRegister.ОценкиКомпетенцийРаботников</registerRecords>
  <registerRecords>CalculationRegister.РасчетСреднегоЗаработка</registerRecords>
  <registerRecords>AccumulationRegister.ФактическаяВыработкаРаботниковОрганизаций</registerRecords>
  <registerRecords>CalculationRegister.УдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ГрафикОтпусковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СотрудникиОсвободившиеСтавкиВОрганизациях</registerRecords>
  <registerRecords>AccumulationRegister.ФактическаяВыработкаРаботников</registerRecords>
  <registerRecords>AccumulationRegister.РасчетПервойПоловиныМесяца</registerRecords>
  <registerRecords>InformationRegister.НамеченныеСобытияПоПерсоналу</registerRecords>
  <registerRecords>InformationRegister.ПредметыЭлектронныхПисем</registerRecords>
  <registerRecords>InformationRegister.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям</registerRecords>
  <registerRecords>AccumulationRegister.ПогашениеЗаймовРаботниками</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОтпуска</registerRecords>
  <registerRecords>InformationRegister.ПроцентДеятельностиЕНВДСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоСовместительству</registerRecords>
  <registerRecords>AccumulationRegister.ЕСНСведенияОДоходах</registerRecords>
  <registerRecords>InformationRegister.ПройденныеУчебныеКурсы</registerRecords>
  <registerRecords>InformationRegister.РеглУчетПлановыхНачисленийРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияРаботников</registerRecords>
  <registerRecords>CalculationRegister.ЕСНДополнительныеНачисления</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.АрхивДанныхРегламентированнойОтчетности</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаИсточникиПерсонала</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСДепонентамиОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СостояниеРаботниковНаИспытательномСроке</registerRecords>
  <registerRecords>InformationRegister.ПланируемаяЗанятостьПомещений</registerRecords>
  <registerRecords>InformationRegister.СостояниеРаботников</registerRecords>
  <registerRecords>InformationRegister.СведенияОВыплатахРаботникамПоПлатежнымВедомостям</registerRecords>
  <registerRecords>InformationRegister.КадровыйПлан</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.ПособияСоциальномуСтрахованию</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаЗаМесяц</registerRecords>
  <registerRecords>InformationRegister.Работники</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛСведенияОДоходах</registerRecords>
  <registerRecords>CalculationRegister.БУДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛИмущественныеВычетыФизлиц</registerRecords>
  <registerRecords>InformationRegister.РаботникиОрганизаций</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете</registerRecords>
  <registerRecords>InformationRegister.ЗаработкиПолучателейПособияПоУходуЗаРебенкомДоПолутораЛет</registerRecords>
  <registerRecords>CalculationRegister.БУОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОтпускаОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СобытийныйПланЗанятостиФизлиц</registerRecords>
  <registerRecords>InformationRegister.УчетЗаработкаРаботников</registerRecords>
  <registerRecords>AccumulationRegister.СтраховыеВзносыСведенияОДоходах</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияРаботников</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПособияПоУходуЗаРебенкомДоПолутораЛет</registerRecords>
  <registerRecords>AccumulationRegister.ВнутрисменноеВремяРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СостояниеРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ЕСНИсчисленный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботниками</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПредоставленныеСтандартныеВычетыФизЛиц</registerRecords>
  <registerRecords>InformationRegister.РаспределениеОсновногоЗаработкаРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СводныеИндивидуальныеГрафики</registerRecords>
  <registerRecords>InformationRegister.ПериодическиеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиВОбучении</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДнейДополнительныхОтпусков</registerRecords>
  <registerRecords>AccumulationRegister.СтраховыеВзносыИсчисленные</registerRecords>
  <registerRecords>AccumulationRegister.РабочееВремяРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛРасчетыСБюджетом</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКЗачету</registerRecords>
  <registerRecords>InformationRegister.ПериодыЗанятостиПомещений</registerRecords>
  <registerRecords>CalculationRegister.ЕСНОсновныеНачисления</registerRecords>
  <registerRecords>InformationRegister.СборДанныхДляПланированияЗанятостиФизлиц</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаЗаМесяцОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПогашениеЗаймовРаботникамиОрганизаций</registerRecords>
  <registerRecords>InformationRegister.абс_СоответствиеОбъектовИнформационнойБазы</registerRecords>
  <registerRecords>InformationRegister.КоэффициентИндексацииЗаработка</registerRecords>
  <registerRecords>CalculationRegister.УправленческиеУдержания</registerRecords>
  <registerRecords>InformationRegister.РаспределениеЗаработкаРаботников</registerRecords>
  <registerRecords>CalculationRegister.УправленческиеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеРабочиеМеста</registerRecords>
  <registerRecords>InformationRegister.ПериодыРаботыРаботников</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидОперации</name>
    <type>
      <types>CatalogRef.абс_ВидыОперацийПереносаДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПереносаОстатков</name>
    <type>
      <types>EnumRef.абс_ТипыПереносаОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Филиал</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КорректировкаЗаписейРегистров</name>
    <type>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровРасчета</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_СоответствиеОбъектов</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Приемник</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_ТипыПереносаОстатков/абс_ТипыПереносаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыПереносаОстатков</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>СозданиеСправочников</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ПереносДанных/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ЗапретОткрытияДокумента Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные табличные части для заполнения
//
// Возвращаемое значение:
//   Список значений с именами табличных частей
//
Функция ПолучитьТабличныеЧастиДляЗаполнения() Экспорт

	ТабличныеЧасти = Новый СписокЗначений;
	
	Возврат ТабличныеЧасти;

КонецФункции // ПолучитьТабличныеЧастиДляЗаполнения()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает/снимает признак активности движений документа
//
Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	Для Каждого Движение Из Движения Цикл   
		Движение.Прочитать();
		Для Каждого Строка Из Движение Цикл
			Строка.Активность = ФлагАктивности;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // УстановитьАктивностьДвижений()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	
	Заголовок = "Копирование документа: "+СокрЛП(ОбъектКопирования);
	ТаблицаРегистров_ДвиженияДокументаОснования = ПолныеПрава.ОпределитьНаличиеДвиженийПоРегистратору(ОбъектКопирования.Ссылка);
	Для каждого Строка из ТаблицаРегистров_ДвиженияДокументаОснования цикл
		//В таблице имя регистра хранится в виде РегистрСведений.<ИмяРегистра>, РегистрНакопления.<ИмяРегистра> и т.д.
		ПолноеИмяРегистра = СокрЛП(Строка.Имя);
		ПозицияТочки = Найти(ПолноеИмяРегистра,".");
		ТипРегистра = Лев(ПолноеИмяРегистра,ПозицияТочки-1);
		//Для получения метаданных тип регистра должен быть не РегистрНакопления а РегистрыНакопления - необходимо изменить тип регистра
		ТипРегистра = СтрЗаменить(ТипРегистра,"Регистр","Регистры");
		ИмяРегистра = Прав(СокрЛП(Строка.Имя),стрДлина(СокрЛП(Строка.Имя))-ПозицияТочки);
		МетаданныеРегистра = Метаданные[ТипРегистра][ИмяРегистра];
		Если НЕ (ПараметрыДоступа("Изменение", МетаданныеРегистра, "", ПользователиИнформационнойБазы.ТекущийПользователь()).Доступность
			И ПараметрыДоступа("Чтение", МетаданныеРегистра, "", ПользователиИнформационнойБазы.ТекущийПользователь()).Доступность) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав доступа к регистру """+ИмяРегистра+"""",ЗапретОткрытияДокумента,Заголовок);
			Продолжить;
		КонецЕсли;
		Набор = ОбъектКопирования.Движения[ИмяРегистра];
		//Используется попытка на случай наличия ограничений доступа к регистру на уровне записей
		Попытка
			Набор.Прочитать();
		Исключение
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Установлено ограничение доступа на уровне записей к регистру """+ИмяРегистра+"""",ЗапретОткрытияДокумента,Заголовок);
			Продолжить;
		КонецПопытки;
		
		НаборТекущегоОбъекта = Движения[ИмяРегистра];
		Для каждого ЗаписьНабора Из Набор Цикл
		
			НоваяЗапись = НаборТекущегоОбъекта.Добавить();
			Если Найти(нрег(ТипРегистра),"накопления")<>0 Тогда
				Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
					НоваяЗапись.ВидДвижения = ЗаписьНабора.ВидДвижения;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,,"Период,Регистратор,ВидДвижения");
				НоваяЗапись.Период				= ТекущаяДата();
				
			ИначеЕсли Найти(нрег(ТипРегистра),"расчета")<>0 Тогда
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,,"ПериодРегистрации,Регистратор");
				НоваяЗапись.ПериодРегистрации	= ТекущаяДата();
				
			Иначе
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,,"Период,Регистратор");
				НоваяЗапись.Период				= ТекущаяДата();
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если  ЗапретОткрытияДокумента Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Документ не может быть скопирован!",ЗапретОткрытияДокумента,Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ПереносДанныхПереопределяемый.ПередЗаписью(Отказ, ЭтотОбъект);
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		//запись помеченного на удаление документа с активными записями
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;
	
	// нач АБС ВСТАВКА Нарыжный 15.04.2014 Филиализация
	Если абс_ТипПереносаОстатков = Перечисления.абс_ТипыПереносаОстатков.ВводОстатков И Не ЗначениеЗаполнено(абс_КорректировкаЗаписейРегистров) Тогда
		НовыйДокументКорректировка = Документы.КорректировкаЗаписейРегистров.СоздатьДокумент();
		НовыйДокументКорректировка.абс_Заблокирована = Истина;
		НовыйДокументКорректировка.Дата = ЭтотОбъект.Дата;
		//НовыйДокументКорректировка.абс_ОрганизацияИсточник = ЭтотОбъект.абс_ДЗО;
		НовыйДокументКорректировка.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		НовыйДокументКорректировка.Записать();
		НовыйДокументКорректировка.УстановитьНовыйНомер();
		ЭтотОбъект.абс_КорректировкаЗаписейРегистров = НовыйДокументКорректировка.Ссылка;		
	КонецЕсли;	
	// кон АБС ВСТАВКА Нарыжный 15.04.2014 Филиализация
	
КонецПроцедуры
// нач АБС ВСТАВКА Нарыжный 15.04.2014 Филиализация
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейСоответствиеОбъектовИнформационнойБазы = ЭтотОбъект.Движения.абс_СоответствиеОбъектовИнформационнойБазы;
	НаборЗаписейСоответствиеОбъектовИнформационнойБазы.Очистить();
	Для  Каждого СтрокаСоответствиеОбъектов Из ЭтотОбъект.абс_СоответствиеОбъектов Цикл
		Если Не ЗначениеЗаполнено(СтрокаСоответствиеОбъектов.Приемник) Тогда 
			Продолжить;
		КонецЕсли;	
		Движение = НаборЗаписейСоответствиеОбъектовИнформационнойБазы.Добавить();
		//Движение.Период = ЭтотОбъект.Дата;
		Движение.Источник = СтрокаСоответствиеОбъектов.Источник;
		Движение.Приемник = СтрокаСоответствиеОбъектов.Приемник;
		Движение.ДЗО = ЭтотОбъект.абс_ДЗО;
		Движение.Филиал = ЭтотОбъект.абс_Филиал;
	КонецЦикла;
	НаборЗаписейСоответствиеОбъектовИнформационнойБазы.Записать();
КонецПроцедуры
// кон АБС ВСТАВКА Нарыжный 15.04.2014 Филиализация
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ЗапретОткрытияДокумента = ложь;
